const TelegramBot = require('node-telegram-bot-api');
const express = require('express');

const {config} = require('dotenv');
config()

const token = process.env.TELEGRAM_TOKEN;
const bot = new TelegramBot(token, {polling: true});
const ksyushaId = 664974738;

const app = express()

bot.onText(/\/echo (.+)/, (msg, match) => {
    const chatId = msg.chat.id;
    const resp = match[1];
    bot.sendMessage(chatId, resp);
});

bot.on('message', async (msg) => {
    const chatId = msg.chat.id;
    const text = msg.text;
    if(text === '/start') {
        await bot.sendMessage(chatId, 'Привет,чтобы сказать, что любишь Ксюшу, нажми кнопку', {
            reply_markup: {
                keyboard: [
                    [{text:'Сказать'}]
                ]
            }
        });
    }
});

const textGenerator = () => {
    const firstWord = ['красивая','добрая','обоятельная','лучшая','прекрасная','ласковая','нежная','заботливая','чуткая','милая', 'родная'];
    const secondWord = ['котенок','черепашонок','писюля','птичка','зайчик','малыш','золотце','любовь моя','мой бриллиант','моя радость'];
    const thirdWord = ['я тебя люблю','я безумно тебя ценю','ты мой афродрзиак','я хочу засыпать и просыпаться с тобой','ты всегда так приятно мурлыкаешь','благодаря тебе мне хочется быть лучше, сильнее, успешнее','спасибо за то, что заботишься обо мне','когда тебя вижу, то все мои 50 оттенков серого окрашиваются в ярко-красный','Моя жизнь превратилась в Страну Чудес, когда ты появилась в ней','Ты моя Маргарита, ради которой я готов стать Мастером на все руки.','Хочется оберегать тебя, как Маленький принц свою Розу','Категорически не могу ссориться с тобой. Ты, когда злишься, так сопеть умилительно начинаешь. Невозможно обижаться','В детстве мечтал стать пиратом. Похоже, стал. Ром пил, бороду отпускал, на корабле плавал, теперь вот клад нашел','Нарушаем, девушка? Где предупредительная табличка “Осторожно! Вызывает бессонницу, рассеянность и влюбленность”','Я не умею делать сальто, а вот мое сердце научилось, когда увидело тебя','Каждый раз, когда ты рядом, у меня ощущение, что весь мир становится более красочным и удивительным','Я не хочу казаться навязчивым, но у тебя настолько сладкие пальчики и сахарные губки, что мне все время хочется целовать их','Я знаю, что ты самостоятельная взрослая девушка, но ничего не могу с собой поделать. Хочу заботиться о тебе все время','Мне трудно выразить свои чувства к тебе, потому что таких сильных эмоций я никогда не испытывал','Спасибо за то, что делаешь меня счастливым','Ты — это самый лучший выбор, который я сделал за свою жизнь. Я рад, что судьба свела нас вместе','Я не хочу видеть рядом кого-либо, кроме тебя. Ты — моя единственная, и я твердо в этом уверен','Без ума от твоей походки. Каждый шаг, каждое движение бедрами дразнит, манит и чертовски заводит']
    let randomizer = (arr) => Math.floor(Math.random() * arr.length);
    let first = randomizer(firstWord);
    let second = randomizer(secondWord)
    let third = randomizer(thirdWord)
    return `Ксюша, ты самая ${firstWord[first]}.Я тебя люблю, ${secondWord[second]}, ${thirdWord[third]}`
}

bot.on('message', async (msg)=> {
    const myId = 668383251;
    if(msg.text === 'Сказать') {
        const text = textGenerator()
        await bot.sendMessage(ksyushaId, text)
        await bot.sendMessage(myId, `я передал твои слова: ${text}`)
    }
})


const PORT = 8000;
app.listen(PORT, ()=>console.log('server started on port' + PORT) )